[
  {
    "recipeId": 1,
    "chefId": 1,
    "recipeName": "Turkish-style Meatballs",
    "foodImage": "https://www.foodiesfeed.com/wp-content/uploads/2023/03/traditional-turkish-baklava-dessert-detail.jpg",
    "ingredients": [
      "1 lb. ground beef",
      "1 onion, finely chopped",
      "1 egg",
      "1/4 cup breadcrumbs",
      "1/4 cup chopped parsley",
      "Salt and pepper, to taste"
    ],
    "cookingMethod": "Mix the ingredients together in a large bowl. Shape the mixture into small balls and place on a baking sheet. Bake in a preheated oven at 375°F for 20-25 minutes or until cooked through.",
    "rating": 4.5
  },
  {
    "recipeId": 2,
    "chefId": 1,
    "recipeName": "Lamb Kebabs with Yogurt Sauce",
    "foodImage": "https://www.foodiesfeed.com/wp-content/uploads/2023/03/traditional-turkish-baklava-dessert-detail.jpg",
    "ingredients": [
      "1 lb. lamb, cut into cubes",
      "1 onion, chopped",
      "1/4 cup olive oil",
      "1/4 cup plain yogurt",
      "1/4 cup lemon juice",
      "1 tsp. ground cumin",
      "Salt and pepper, to taste"
    ],
    "cookingMethod": "Thread the lamb onto skewers and grill over medium heat for 8-10 minutes or until cooked to your liking. In a separate bowl, mix the remaining ingredients to make the yogurt sauce. Serve the kebabs with the yogurt sauce.",
    "rating": 4.8
  },
  {
    "recipeId": 3,
    "chefId": 1,
    "recipeName": "Baklava",
    "foodImage": "https://www.foodiesfeed.com/wp-content/uploads/2023/03/traditional-turkish-baklava-dessert-detail.jpg",
    "ingredients": [
      "1 lb. phyllo dough",
      "1 lb. chopped walnuts",
      "1 cup melted butter",
      "1/2 cup sugar",
      "1/2 cup water",
      "1/4 cup honey",
      "1 tbsp. lemon juice"
    ],
    "cookingMethod": "Preheat oven to 350°F. In a mixing bowl, combine the walnuts, sugar, and melted butter. Spread a layer of phyllo dough in a baking dish, then spread a layer of the nut mixture on top. Repeat the layers until all ingredients are used, ending with a layer of phyllo dough. Cut the baklava into small diamond-shaped pieces. Bake for 45 minutes or until golden brown. While the baklava is baking, heat the honey, water, and lemon juice in a saucepan until boiling. Pour the honey mixture over the baklava as soon as it comes out of the oven. Let cool and serve.",
    "rating": 4.9
  },
  {
    "recipeId": 4,
    "chefId": 2,
    "recipeName": "Lentil Soup",
    "foodImage": "https://www.foodiesfeed.com/wp-content/uploads/2023/03/traditional-turkish-baklava-dessert-detail.jpg",
    "ingredients": [
      "1 cup red lentils",
      "1 onion, chopped",
      "2 cloves garlic, minced",
      "4 cups chicken broth",
      "2 tbsp. tomato paste",
      "1 tsp. ground cumin",
      "Salt and pepper, to taste"
    ],
    "cookingMethod": "In a large pot, sauté the onion and garlic in olive oil until soft. Add the lentils, chicken broth, tomato paste, cumin, salt, and pepper. Bring to a boil, then reduce heat and let simmer for 20-25 minutes, or until the lentils are tender. Use an immersion blender or a regular blender to puree the soup until smooth. If desired, you can garnish the soup with a drizzle of olive oil and a sprinkle of fresh parsley. Serve hot and enjoy!",
    "rating": 4.7
  },
  {
    "recipeId": 5,
    "chefId": 1,
    "recipeName": "Manti (Turkish Dumplings)",
    "foodImage": "https://www.foodiesfeed.com/wp-content/uploads/2023/03/traditional-turkish-baklava-dessert-detail.jpg",
    "ingredients": [
      "1 lb. ground beef",
      "1 onion, finely chopped",
      "1/2 tsp. ground black pepper",
      "1/2 tsp. salt",
      "1/4 tsp. ground cumin",
      "1/4 tsp. paprika",
      "1/4 cup melted butter",
      "1/2 cup plain yogurt",
      "1/4 cup tomato sauce",
      "2 cloves garlic, minced",
      "Fresh parsley, chopped (for garnish)"
    ],
    "cookingMethod": "In a bowl, mix the ground beef, onion, black pepper, salt, cumin, and paprika until well combined. Roll out the dough into a thin sheet and cut it into small squares. Place a small amount of the beef mixture in the center of each square and fold the dough over to form a dumpling. Press the edges to seal. Bring a large pot of salted water to a boil and cook the dumplings until they float to the surface. Drain the dumplings and transfer them to a serving dish. In a separate bowl, mix the melted butter, yogurt, tomato sauce, and minced garlic. Pour the sauce over the dumplings and garnish with chopped parsley. Serve hot.",
    "rating": 4.6
  },
  {
    "recipeId": 6,
    "chefId": 1,
    "recipeName": "Pilaf with Chickpeas",
    "foodImage": "https://www.foodiesfeed.com/wp-content/uploads/2023/03/traditional-turkish-baklava-dessert-detail.jpg",
    "ingredients": [
      "1 cup basmati rice",
      "1 can chickpeas, drained and rinsed",
      "1 onion, chopped",
      "2 cloves garlic, minced",
      "2 tbsp. olive oil",
      "1 tsp. ground cumin",
      "1 tsp. ground coriander",
      "1/2 tsp. turmeric",
      "2 cups vegetable broth",
      "Salt and pepper, to taste",
      "Fresh cilantro, chopped (for garnish)"
    ],
    "cookingMethod": "In a large pot, heat the olive oil over medium heat. Add the chopped onion and minced garlic, and sauté until softened. Add the ground cumin, ground coriander, and turmeric, and cook for another minute. Add the basmati rice and chickpeas to the pot, and stir to coat them with the spices. Pour in the vegetable broth and season with salt and pepper. Bring the mixture to a boil, then reduce the heat to low, cover the pot, and simmer for 15-20 minutes, or until the rice is cooked and the liquid is absorbed. Fluff the rice with a fork, and garnish with fresh chopped cilantro. Serve hot as a delicious side dish.",
    "rating": 4.3
  },

  {
    "recipeId": 7,
    "chefId": 1,
    "recipeName": "Turkish Red Lentil Soup",
    "foodImage": "https://www.foodiesfeed.com/wp-content/uploads/2023/03/traditional-turkish-baklava-dessert-detail.jpg",
    "ingredients": [
      "1 cup red lentils",
      "1 onion, chopped",
      "2 carrots, diced",
      "2 cloves garlic, minced",
      "4 cups vegetable broth",
      "2 tbsp. tomato paste",
      "1 tsp. ground cumin",
      "1/2 tsp. paprika",
      "1/4 tsp. cayenne pepper",
      "Salt and pepper, to taste",
      "2 tbsp. olive oil",
      "Lemon wedges and fresh parsley (for serving)"
    ],
    "cookingMethod": "In a large pot, heat the olive oil over medium heat. Add the chopped onion, diced carrots, and minced garlic. Sauté until the vegetables are softened, about 5 minutes. Rinse the red lentils under cold water, then add them to the pot along with the vegetable broth, tomato paste, ground cumin, paprika, and cayenne pepper. Season with salt and pepper to taste. Bring the soup to a boil, then reduce the heat to low and let it simmer for 20-25 minutes, or until the lentils are tender. Using an immersion blender or a regular blender, puree the soup until smooth and creamy. If needed, adjust the consistency by adding more vegetable broth. Taste and adjust the seasoning if necessary. Serve hot with a squeeze of lemon juice and garnish with fresh parsley. Enjoy!",
    "rating": 4.7
  },
  {
    "recipeId": 8,
    "chefId": 2,
    "recipeName": "Turkish Lamb Stew",
    "foodImage": "https://www.foodiesfeed.com/wp-content/uploads/2023/03/traditional-turkish-baklava-dessert-detail.jpg",
    "ingredients": [
      "1.5 lb. lamb shoulder, cubed",
      "1 onion, chopped",
      "2 cloves garlic, minced",
      "2 carrots, sliced",
      "2 potatoes, diced",
      "1 cup diced tomatoes",
      "2 cups beef broth",
      "1 tsp. paprika",
      "1/2 tsp. ground cumin",
      "1/2 tsp. dried thyme",
      "Salt and pepper, to taste",
      "2 tbsp. olive oil",
      "Fresh parsley, chopped (for garnish)"
    ],
    "cookingMethod": "In a large pot, heat the olive oil over medium heat. Add the lamb cubes and brown them on all sides. Remove the lamb from the pot and set it aside. In the same pot, add the chopped onion and minced garlic. Sauté until the onion is translucent. Add the carrots, potatoes, diced tomatoes, beef broth, paprika, ground cumin, dried thyme, salt, and pepper. Stir well. Return the browned lamb to the pot. Bring the mixture to a boil, then reduce the heat to low, cover, and simmer for about 1.5 to 2 hours, or until the lamb is tender and the flavors are well combined. Serve hot, garnished with fresh chopped parsley.",
    "rating": 4.6
  },
  {
    "recipeId": 9,
    "chefId": 2,
    "recipeName": "Turkish Spinach and Feta Borek",
    "foodImage": "https://www.foodiesfeed.com/wp-content/uploads/2023/03/traditional-turkish-baklava-dessert-detail.jpg",
    "ingredients": [
      "1 lb. phyllo dough",
      "2 cups fresh spinach, chopped",
      "1 cup crumbled feta cheese",
      "1/2 cup chopped fresh parsley",
      "1/4 cup melted butter",
      "1 egg, beaten",
      "Salt and pepper, to taste"
    ],
    "cookingMethod": "Preheat the oven to 350°F. In a mixing bowl, combine the chopped spinach, crumbled feta cheese, chopped parsley, melted butter, beaten egg, salt, and pepper. Mix well to combine all the ingredients. Lay out a sheet of phyllo dough and brush it lightly with melted butter. Place another sheet on top and repeat the process until you have a stack of 5-6 phyllo sheets. Spread a layer of the spinach and feta mixture evenly over the phyllo stack. Roll up the phyllo stack tightly into a log shape. Repeat the process with the remaining phyllo sheets and filling. Place the rolled phyllo logs on a baking sheet and brush the tops with melted butter. Bake in the preheated oven for 25-30 minutes or until golden brown and crispy. Remove from the oven and let cool for a few minutes before slicing into portions. Serve warm as a delicious appetizer or snack.",
    "rating": 4.8
  },
  {
    "recipeId": 10,
    "chefId": 2,
    "recipeName": "Turkish Rice Pudding (Sütlaç)",
    "foodImage": "https://www.foodiesfeed.com/wp-content/uploads/2023/03/traditional-turkish-baklava-dessert-detail.jpg",
    "ingredients": [
      "1/2 cup short-grain rice",
      "4 cups milk",
      "1/2 cup sugar",
      "1 tsp. vanilla extract",
      "1/4 cup water",
      "2 tbsp. cornstarch",
      "1/4 cup raisins (optional)",
      "Ground cinnamon (for garnish)"
    ],
    "cookingMethod": "In a medium-sized saucepan, combine the rice, milk, sugar, and vanilla extract. Place the saucepan over medium heat and bring the mixture to a simmer. Stir occasionally to prevent the rice from sticking to the bottom of the pan. In a separate small bowl, dissolve the cornstarch in water, then add it to the saucepan with the rice mixture. Stir well to combine. Continue cooking the pudding over low heat, stirring constantly, until the rice is cooked and the pudding has thickened to a creamy consistency. If desired, add the raisins and stir them into the pudding. Remove the pudding from the heat and let it cool for a few minutes. Transfer the pudding into individual serving bowls or glasses. Sprinkle ground cinnamon on top for garnish. Refrigerate the pudding for a few hours or until chilled. Serve cold and enjoy!",
    "rating": 4.5
  },
  {
    "recipeId": 11,
    "chefId": 3,
    "recipeName": "Turkish Baklava",
    "foodImage": "https://www.foodiesfeed.com/wp-content/uploads/2023/03/traditional-turkish-baklava-dessert-detail.jpg",
    "ingredients": [
      "1 lb. phyllo dough",
      "2 cups finely chopped walnuts",
      "1 cup unsalted butter, melted",
      "1 cup granulated sugar",
      "1 cup water",
      "1 tbsp. lemon juice",
      "1 tsp. ground cinnamon",
      "1/2 tsp. ground cloves",
      "1/2 tsp. vanilla extract",
      "Honey (for drizzling)"
    ],
    "cookingMethod": "Preheat the oven to 350°F. In a mixing bowl, combine the finely chopped walnuts, sugar, ground cinnamon, and ground cloves. Mix well to combine all the ingredients. Lay out a sheet of phyllo dough and brush it lightly with melted butter. Place another sheet on top and repeat the process until you have a stack of 5-6 phyllo sheets. Spread a thin layer of the walnut mixture evenly over the phyllo stack. Repeat the process with another stack of phyllo sheets and walnut mixture until all the ingredients are used. With a sharp knife, cut the baklava into diamond or square shapes. Bake in the preheated oven for 30-35 minutes or until golden brown and crispy. While the baklava is baking, prepare the syrup by combining water, sugar, lemon juice, and vanilla extract in a saucepan. Bring the mixture to a boil, then reduce the heat and simmer for about 10 minutes. Remove the baklava from the oven and immediately pour the syrup over it, allowing it to soak into the layers. Let the baklava cool completely, then drizzle honey on top before serving. Enjoy this sweet and flaky Turkish dessert!",
    "rating": 4.9
  },
  {
    "recipeId": 12,
    "chefId": 3,
    "recipeName": "Turkish Chicken Kebabs",
    "foodImage": "https://www.foodiesfeed.com/wp-content/uploads/2023/03/traditional-turkish-baklava-dessert-detail.jpg",
    "ingredients": [
      "1 lb. boneless, skinless chicken breasts, cut into cubes",
      "1/4 cup olive oil",
      "2 tbsp. lemon juice",
      "2 cloves garlic, minced",
      "1 tsp. ground cumin",
      "1 tsp. ground paprika",
      "1/2 tsp. ground coriander",
      "Salt and pepper, to taste",
      "Wooden skewers, soaked in water"
    ],
    "cookingMethod": "In a bowl, combine the olive oil, lemon juice, minced garlic, ground cumin, ground paprika, ground coriander, salt, and pepper. Mix well to create a marinade. Add the chicken cubes to the marinade and toss to coat them evenly. Cover the bowl and let the chicken marinate in the refrigerator for at least 1 hour or overnight for best results. Preheat the grill to medium-high heat. Thread the marinated chicken cubes onto the soaked wooden skewers. Grill the chicken kebabs for 8-10 minutes, turning occasionally, or until the chicken is cooked through and nicely charred. Remove the kebabs from the grill and let them rest for a few minutes before serving. Serve hot with your favorite side dishes or in a pita bread as a delicious chicken kebab sandwich.",
    "rating": 4.7
  },
  {
    "recipeId": 13,
    "chefId": 3,
    "recipeName": "Turkish Eggplant Salad",
    "foodImage": "https://www.foodiesfeed.com/wp-content/uploads/2023/03/traditional-turkish-baklava-dessert-detail.jpg",
    "ingredients": [
      "2 large eggplants",
      "2 tomatoes, diced",
      "1 red bell pepper, diced",
      "1 green bell pepper, diced",
      "1 small red onion, finely chopped",
      "2 cloves garlic, minced",
      "3 tbsp. olive oil",
      "2 tbsp. lemon juice",
      "1 tbsp. chopped fresh parsley",
      "Salt and pepper, to taste"
    ],
    "cookingMethod": "Preheat the oven to 400°F. Place the whole eggplants on a baking sheet and roast them in the oven for about 30-40 minutes, or until the skin is charred and the flesh is soft. Remove the eggplants from the oven and let them cool. Once cooled, peel off the charred skin and discard. Chop the eggplants into small pieces and transfer them to a mixing bowl. Add the diced tomatoes, red bell pepper, green bell pepper, finely chopped red onion, minced garlic, olive oil, lemon juice, chopped fresh parsley, salt, and pepper to the bowl with the chopped eggplants. Mix well to combine all the ingredients. Adjust the seasoning if necessary. Let the salad sit for about 15-20 minutes to allow the flavors to meld together. Serve the Turkish Eggplant Salad at room temperature as a side dish or as a spread with bread or pita. Enjoy!",
    "rating": 4.6
  },
  {
    "recipeId": 14,
    "chefId": 4,
    "recipeName": "Turkish Manti",
    "foodImage": "https://www.foodiesfeed.com/wp-content/uploads/2023/03/traditional-turkish-baklava-dessert-detail.jpg",
    "ingredients": [
      "1 lb. ground beef",
      "1 small onion, finely chopped",
      "2 cloves garlic, minced",
      "1/2 tsp. ground cumin",
      "1/2 tsp. paprika",
      "Salt and pepper, to taste",
      "1 package square wonton wrappers",
      "1 cup plain yogurt",
      "2 tbsp. melted butter",
      "2 tbsp. tomato paste",
      "2 cloves garlic, crushed",
      "1/4 cup chopped fresh parsley",
      "Red pepper flakes (optional)"
    ],
    "cookingMethod": "In a mixing bowl, combine the ground beef, finely chopped onion, minced garlic, ground cumin, paprika, salt, and pepper. Mix well until all the ingredients are well combined. Take a square wonton wrapper and place a small amount of the beef mixture in the center. Fold the wrapper into a triangle, sealing the edges tightly. Repeat with the remaining wrappers and filling. In a large pot of boiling salted water, cook the manti for about 8-10 minutes or until they float to the surface. Remove the cooked manti from the water and set them aside. In a small bowl, whisk together the plain yogurt, melted butter, tomato paste, crushed garlic, and salt. Place the cooked manti on a serving dish and drizzle the yogurt sauce over them. Sprinkle with chopped fresh parsley and red pepper flakes if desired. Serve hot and enjoy!",
    "rating": 4.8
  },
  {
    "recipeId": 15,
    "chefId": 4,
    "recipeName": "Turkish Stuffed Grape Leaves (Dolma)",
    "foodImage": "https://www.foodiesfeed.com/wp-content/uploads/2023/03/traditional-turkish-baklava-dessert-detail.jpg",
    "ingredients": [
      "1 jar grape leaves",
      "1 cup rice",
      "1/2 lb. ground beef or lamb",
      "1 small onion, finely chopped",
      "2 cloves garlic, minced",
      "1/4 cup chopped fresh parsley",
      "1/4 cup chopped fresh mint",
      "1/4 cup pine nuts",
      "2 tbsp. olive oil",
      "1 tbsp. lemon juice",
      "1 tsp. ground cumin",
      "1 tsp. ground coriander",
      "Salt and pepper, to taste",
      "Water, as needed"
    ],
    "cookingMethod": "In a large bowl, rinse the rice under cold water until the water runs clear. Drain the rice and set it aside. In a separate bowl, combine the ground beef or lamb, finely chopped onion, minced garlic, chopped fresh parsley, chopped fresh mint, pine nuts, olive oil, lemon juice, ground cumin, ground coriander, salt, and pepper. Mix well to combine all the ingredients. Take a grape leaf and place a small amount of the meat mixture in the center. Fold the sides of the leaf over the filling, then roll it tightly into a cylinder shape. Repeat with the remaining grape leaves and filling. Place a layer of grape leaves on the bottom of a large pot to prevent the stuffed grape leaves from sticking. Arrange the stuffed grape leaves in layers, making sure they are tightly packed. Pour enough water into the pot to cover the grape leaves. Place a heat-resistant plate on top of the grape leaves to weigh them down during cooking. Cover the pot and bring it to a boil. Reduce the heat to low and let the stuffed grape leaves simmer for about 45 minutes to 1 hour, or until the rice is cooked and the flavors are well combined. Remove from the heat and let the stuffed grape leaves cool in the pot. Serve the Turkish Stuffed Grape Leaves (Dolma) at room temperature as an appetizer or as a side dish. Enjoy!",
    "rating": 4.7
  },
  {
    "recipeId": 16,
    "chefId": 4,
    "recipeName": "Turkish Lamb Kebabs",
    "foodImage": "https://www.foodiesfeed.com/wp-content/uploads/2023/03/traditional-turkish-baklava-dessert-detail.jpg",
    "ingredients": [
      "1 lb. lamb meat, cubed",
      "1/4 cup olive oil",
      "2 tbsp. lemon juice",
      "2 cloves garlic, minced",
      "1 tsp. ground cumin",
      "1 tsp. ground paprika",
      "1/2 tsp. ground coriander",
      "Salt and pepper, to taste",
      "Wooden skewers, soaked in water"
    ],
    "cookingMethod": "In a bowl, combine the olive oil, lemon juice, minced garlic, ground cumin, ground paprika, ground coriander, salt, and pepper. Mix well to create a marinade. Add the cubed lamb meat to the marinade and toss to coat it evenly. Cover the bowl and let the lamb marinate in the refrigerator for at least 1 hour or overnight for best results. Preheat the grill to medium-high heat. Thread the marinated lamb cubes onto the soaked wooden skewers. Grill the lamb kebabs for 10-12 minutes, turning occasionally, or until the meat is cooked to your desired level of doneness. Remove the kebabs from the grill and let them rest for a few minutes before serving. Serve hot with your choice of side dishes, such as rice, salad, or bread. Enjoy the delicious and flavorful Turkish Lamb Kebabs!",
    "rating": 4.9
  },
  {
    "recipeId": 17,
    "chefId": 5,
    "recipeName": "Turkish Pide",
    "foodImage": "https://www.foodiesfeed.com/wp-content/uploads/2023/03/traditional-turkish-baklava-dessert-detail.jpg",
    "ingredients": [
      "3 1/2 cups all-purpose flour",
      "2 tsp. active dry yeast",
      "1 tsp. sugar",
      "1 tsp. salt",
      "1 cup warm water",
      "2 tbsp. olive oil",
      "1/2 lb. ground lamb or beef",
      "1 small onion, finely chopped",
      "2 cloves garlic, minced",
      "1 tomato, diced",
      "1/2 cup chopped fresh parsley",
      "1 tsp. ground cumin",
      "1 tsp. paprika",
      "Salt and pepper, to taste",
      "1 egg, beaten (for egg wash)"
    ],
    "cookingMethod": "In a small bowl, dissolve the active dry yeast and sugar in warm water. Let it sit for about 5 minutes until the mixture becomes foamy. In a large mixing bowl, combine the all-purpose flour and salt. Make a well in the center and pour in the yeast mixture and olive oil. Mix everything together until a dough forms. Knead the dough on a lightly floured surface for about 5-7 minutes until it becomes smooth and elastic. Place the dough in a greased bowl, cover it with a clean kitchen towel, and let it rise in a warm place for about 1 hour or until it doubles in size. Meanwhile, in a skillet, cook the ground lamb or beef over medium heat until browned. Add the finely chopped onion, minced garlic, diced tomato, chopped fresh parsley, ground cumin, paprika, salt, and pepper. Cook for another 5 minutes until the flavors meld together. Preheat the oven to 450°F. Divide the dough into 2 equal parts. Roll out each part into an oval shape on a baking sheet lined with parchment paper. Spoon half of the lamb or beef mixture onto each dough oval, leaving a border around the edges. Fold the edges over the filling to form a boat shape. Brush the edges with beaten egg wash. Bake the Turkish Pide in the preheated oven for 15-20 minutes or until the crust is golden brown. Remove from the oven and let it cool for a few minutes before serving. Slice and enjoy the delicious Turkish Pide!",
    "rating": 4.8
  },
  {
    "recipeId": 18,
    "chefId": 5,
    "recipeName": "Turkish Baklava",
    "foodImage": "https://www.foodiesfeed.com/wp-content/uploads/2023/03/traditional-turkish-baklava-dessert-detail.jpg",
    "ingredients": [
      "1 lb. phyllo dough",
      "1 1/2 cups unsalted butter, melted",
      "3 cups finely ground walnuts or pistachios",
      "1 cup granulated sugar",
      "1 tsp. ground cinnamon",
      "1/2 cup water",
      "1/2 cup honey",
      "1 tbsp. lemon juice"
    ],
    "cookingMethod": "Preheat the oven to 350°F. In a bowl, mix together the finely ground walnuts or pistachios, granulated sugar, and ground cinnamon. Set the nut mixture aside. Brush a baking dish with melted butter. Place a sheet of phyllo dough in the bottom of the baking dish and brush it with melted butter. Repeat the process with half of the phyllo dough sheets, brushing each sheet with melted butter. Sprinkle half of the nut mixture evenly over the layered phyllo dough. Continue layering the remaining phyllo dough sheets, brushing each sheet with melted butter, and sprinkling the remaining nut mixture. Once all the layers are assembled, use a sharp knife to cut the baklava into diamond or square shapes. Bake the baklava in the preheated oven for about 35-40 minutes or until it turns golden brown and crispy. While the baklava is baking, combine the water, honey, and lemon juice in a small saucepan. Bring the mixture to a gentle boil, then reduce the heat and let it simmer for about 10 minutes, stirring occasionally. Remove the baklava from the oven and immediately pour the hot honey syrup over it, making sure to cover all the pieces. Let the baklava cool completely in the baking dish, allowing it to absorb the syrup. Once cooled, carefully remove the individual pieces and serve. Enjoy the sweet and nutty delight of Turkish Baklava!",
    "rating": 4.9
  },
  {
    "recipeId": 19,
    "chefId": 6,
    "recipeName": "Turkish Iskender Kebab",
    "foodImage": "https://www.foodiesfeed.com/wp-content/uploads/2023/03/traditional-turkish-baklava-dessert-detail.jpg",
    "ingredients": [
      "1 lb. beef or lamb, thinly sliced",
      "1/4 cup olive oil",
      "2 tbsp. tomato paste",
      "2 cloves garlic, minced",
      "1 tsp. ground cumin",
      "1 tsp. paprika",
      "Salt and pepper, to taste",
      "4 pita breads",
      "2 cups plain yogurt",
      "2 tbsp. butter",
      "1/4 cup melted butter",
      "1/4 cup tomato sauce",
      "1/4 cup yogurt",
      "Fresh parsley, for garnish"
    ],
    "cookingMethod": "In a bowl, combine the olive oil, tomato paste, minced garlic, ground cumin, paprika, salt, and pepper. Add the thinly sliced beef or lamb to the marinade and toss to coat it evenly. Let the meat marinate for at least 30 minutes, or refrigerate it overnight for enhanced flavor. Preheat a grill or a large skillet over medium-high heat. Cook the marinated meat slices for about 3-4 minutes on each side, or until they are cooked to your desired level of doneness. Remove the meat from the heat and let it rest for a few minutes. While the meat is resting, warm the pita breads on a grill or in a toaster. Cut the warm pita breads into small triangles and place them on a serving platter. In a small saucepan, melt the butter over low heat. Pour the melted butter over the warm pita bread triangles, making sure to coat them evenly. In a separate bowl, mix together the tomato sauce and yogurt. Spread the tomato-yogurt mixture over the pita bread triangles. Arrange the cooked meat slices on top of the sauced pita bread triangles. Drizzle the melted butter over the meat. Garnish with fresh parsley. Serve the Turkish Iskender Kebab immediately and enjoy!",
    "rating": 4.6
  },
  {
    "recipeId": 20,
    "chefId": 7,
    "recipeName": "Turkish Manti",
    "foodImage": "https://www.foodiesfeed.com/wp-content/uploads/2023/03/traditional-turkish-baklava-dessert-detail.jpg",
    "ingredients": [
      "1 lb. ground beef or lamb",
      "1 small onion, finely chopped",
      "2 cloves garlic, minced",
      "1/2 tsp. ground black pepper",
      "1/2 tsp. ground cumin",
      "1/2 tsp. paprika",
      "1/2 tsp. dried mint",
      "Salt, to taste",
      "2 cups all-purpose flour",
      "1/2 cup water",
      "1/4 cup olive oil",
      "1 cup plain yogurt",
      "2 tbsp. melted butter",
      "1/4 cup tomato sauce",
      "1/4 cup chicken or beef broth",
      "Fresh parsley, for garnish"
    ],
    "cookingMethod": "In a bowl, combine the ground beef or lamb, finely chopped onion, minced garlic, ground black pepper, ground cumin, paprika, dried mint, and salt. Mix well to incorporate all the ingredients. In a separate bowl, mix together the all-purpose flour, water, and olive oil to make a dough. Knead the dough for about 5 minutes until it becomes smooth and elastic. Cover the dough and let it rest for 30 minutes. Roll out the dough on a lightly floured surface to about 1/8-inch thickness. Cut the rolled-out dough into small squares or circles, approximately 1 inch in size. Place a small amount of the meat mixture in the center of each dough square or circle. Fold the dough over the filling to form a sealed pocket. Pinch the edges to ensure they are properly sealed. In a large pot, bring water to a boil. Add salt to the boiling water. Carefully drop the filled manti into the boiling water and cook for about 10-15 minutes or until they float to the surface and are cooked through. While the manti are cooking, prepare the sauce by combining the plain yogurt, melted butter, tomato sauce, and chicken or beef broth in a separate saucepan. Heat the sauce over low heat until warmed through. Once the manti are cooked, drain them from the water and divide them into serving bowls. Pour the warm yogurt sauce over the manti. Garnish with fresh parsley. Serve the Turkish Manti immediately and enjoy!",
    "rating": 4.7
  },
  {
    "recipeId": 21,
    "chefId": 8,
    "recipeName": "Turkish Menemen",
    "foodImage": "https://www.foodiesfeed.com/wp-content/uploads/2023/03/traditional-turkish-baklava-dessert-detail.jpg",
    "ingredients": [
      "2 tbsp. olive oil",
      "1 small onion, thinly sliced",
      "1 red bell pepper, thinly sliced",
      "1 green bell pepper, thinly sliced",
      "2 tomatoes, diced",
      "4 eggs",
      "1/2 tsp. dried oregano",
      "1/2 tsp. ground cumin",
      "Salt and pepper, to taste",
      "Fresh parsley, chopped, for garnish",
      "Feta cheese, crumbled, for serving",
      "Bread, for serving"
    ],
    "cookingMethod": "Heat the olive oil in a large skillet over medium heat. Add the thinly sliced onion and sauté for a few minutes until it becomes translucent. Add the sliced red and green bell peppers to the skillet and cook for another 5 minutes until they start to soften. Stir in the diced tomatoes and cook for an additional 3-4 minutes until the tomatoes release their juices. Create wells in the vegetable mixture and crack the eggs into the wells. Sprinkle the dried oregano, ground cumin, salt, and pepper over the eggs and vegetables. Cover the skillet and let it cook for about 5-7 minutes, or until the eggs are cooked to your desired level of doneness. Once the eggs are cooked, remove the skillet from the heat. Garnish with fresh chopped parsley. Serve the Turkish Menemen immediately with crumbled feta cheese on top and bread on the side for dipping. Enjoy this delicious and satisfying Turkish breakfast dish!",
    "rating": 4.8
  },
  {
    "recipeId": 22,
    "chefId": 8,
    "recipeName": "Turkish Pide with Spinach and Feta",
    "foodImage": "https://www.foodiesfeed.com/wp-content/uploads/2023/03/traditional-turkish-baklava-dessert-detail.jpg",
    "ingredients": [
      "2 cups all-purpose flour",
      "1 tsp. instant yeast",
      "1/2 tsp. sugar",
      "1/2 tsp. salt",
      "1/2 cup warm water",
      "2 tbsp. olive oil",
      "2 cups fresh spinach, chopped",
      "1 cup crumbled feta cheese",
      "1 small onion, thinly sliced",
      "1 tsp. dried oregano",
      "1 tsp. dried thyme",
      "Salt and pepper, to taste",
      "1 egg, beaten (for egg wash)"
    ],
    "cookingMethod": "In a mixing bowl, combine the all-purpose flour, instant yeast, sugar, and salt. Make a well in the center and pour in the warm water and olive oil. Mix everything together until a dough forms. Knead the dough on a lightly floured surface for about 5-7 minutes until it becomes smooth and elastic. Place the dough in a greased bowl, cover it with a clean kitchen towel, and let it rise in a warm place for about 1 hour or until it doubles in size. Preheat the oven to 450°F. Punch down the dough and divide it into 2 equal parts. Roll out each part into an oval shape on a baking sheet lined with parchment paper. In a separate bowl, mix together the chopped fresh spinach, crumbled feta cheese, thinly sliced onion, dried oregano, dried thyme, salt, and pepper. Spread half of the spinach and feta mixture onto each dough oval, leaving a border around the edges. Fold the edges over the filling to form a boat shape. Brush the edges with beaten egg wash. Bake the Turkish Pide in the preheated oven for 15-20 minutes or until the crust is golden brown. Remove from the oven and let it cool for a few minutes before serving. Slice and enjoy the flavorful Turkish Pide with Spinach and Feta!",
    "rating": 4.7
  },
  {
    "recipeId": 23,
    "chefId": 8,
    "recipeName": "Turkish Stuffed Eggplant (Karniyarik)",
    "foodImage": "https://www.foodiesfeed.com/wp-content/uploads/2023/03/traditional-turkish-baklava-dessert-detail.jpg",
    "ingredients": [
      "4 small eggplants",
      "1/2 lb. ground beef or lamb",
      "1 small onion, finely chopped",
      "2 cloves garlic, minced",
      "2 tomatoes, diced",
      "2 tbsp. tomato paste",
      "1 tsp. ground cumin",
      "1 tsp. paprika",
      "Salt and pepper, to taste",
      "2 tbsp. olive oil",
      "Fresh parsley, chopped, for garnish",
      "Greek yogurt, for serving"
    ],
    "cookingMethod": "Preheat the oven to 400°F. Cut the eggplants in half lengthwise, leaving the stem intact. Score the flesh of each eggplant half with a knife, being careful not to pierce the skin. Place the eggplants on a baking sheet and drizzle them with olive oil. Season with salt and pepper. Bake the eggplants in the preheated oven for about 30 minutes, or until they become tender. Meanwhile, prepare the stuffing. In a skillet, cook the ground beef or lamb over medium heat until browned. Add the finely chopped onion, minced garlic, diced tomatoes, tomato paste, ground cumin, paprika, salt, and pepper. Stir everything together and cook for about 5-7 minutes until the onions become translucent and the tomatoes release their juices. Remove the baked eggplants from the oven and let them cool slightly. Carefully scoop out the flesh from the eggplants, leaving a thin layer of flesh attached to the skin. Chop the scooped-out eggplant flesh and add it to the skillet with the stuffing mixture. Stir everything together and cook for another 2-3 minutes. Fill each eggplant half with the stuffing mixture. Return the stuffed eggplants to the baking sheet and bake them for an additional 15-20 minutes, or until the tops are golden brown. Garnish with fresh chopped parsley. Serve the Turkish Stuffed Eggplant (Karniyarik) hot with a side of Greek yogurt. Enjoy this delicious and comforting Turkish dish!",
    "rating": 4.8
  },
  {
    "recipeId": 24,
    "chefId": 7,
    "recipeName": "Turkish Lahmacun",
    "foodImage": "https://www.foodiesfeed.com/wp-content/uploads/2023/03/traditional-turkish-baklava-dessert-detail.jpg",
    "ingredients": [
      "1 lb. ground lamb or beef",
      "1 small onion, finely chopped",
      "2 cloves garlic, minced",
      "2 tomatoes, diced",
      "2 tbsp. tomato paste",
      "1 tsp. ground cumin",
      "1 tsp. paprika",
      "1/2 tsp. ground cinnamon",
      "Salt and pepper, to taste",
      "2 cups all-purpose flour",
      "1 tsp. instant yeast",
      "1/2 tsp. sugar",
      "1/2 tsp. salt",
      "3/4 cup warm water",
      "2 tbsp. olive oil",
      "Fresh parsley, chopped, for garnish",
      "Lemon wedges, for serving"
    ],
    "cookingMethod": "In a mixing bowl, combine the ground lamb or beef, finely chopped onion, minced garlic, diced tomatoes, tomato paste, ground cumin, paprika, ground cinnamon, salt, and pepper. Mix everything together until well combined. Set the mixture aside to marinate for at least 30 minutes. In another bowl, combine the all-purpose flour, instant yeast, sugar, and salt. Add the warm water and olive oil. Mix everything together until a dough forms. Knead the dough on a lightly floured surface for about 5 minutes until it becomes smooth and elastic. Place the dough in a greased bowl, cover it with a clean kitchen towel, and let it rise in a warm place for about 1 hour or until it doubles in size. Preheat the oven to 500°F. Divide the dough into smaller portions and roll each portion into a thin circle. Place the rolled dough on a baking sheet lined with parchment paper. Spread a thin layer of the marinated meat mixture evenly over the dough circles. Bake the Lahmacun in the preheated oven for about 10-12 minutes or until the crust is golden brown and the meat is cooked through. Remove from the oven and garnish with fresh chopped parsley. Serve the Turkish Lahmacun with lemon wedges on the side. Enjoy this flavorful and traditional Turkish dish!",
    "rating": 4.9
  },
  {
    "recipeId": 25,
    "chefId": 7,
    "recipeName": "Turkish Baklava",
    "foodImage": "https://www.foodiesfeed.com/wp-content/uploads/2023/03/traditional-turkish-baklava-dessert-detail.jpg",
    "ingredients": [
      "1 lb. phyllo dough",
      "1 lb. unsalted butter, melted",
      "3 cups finely chopped walnuts",
      "1 cup granulated sugar",
      "1 tsp. ground cinnamon",
      "1/2 tsp. ground cloves",
      "1/2 cup water",
      "1/2 cup honey",
      "1 tsp. lemon juice"
    ],
    "cookingMethod": "Preheat the oven to 350°F. In a bowl, combine the finely chopped walnuts, granulated sugar, ground cinnamon, and ground cloves. Mix everything together until well combined. Brush a baking dish with melted butter. Layer several sheets of phyllo dough in the baking dish, brushing each layer with melted butter. Sprinkle a thin layer of the walnut mixture over the phyllo dough. Repeat the layering process with more phyllo dough and walnut mixture until all the ingredients are used, ending with a layer of phyllo dough on top. Before baking, score the top layer of phyllo dough into diamond or square shapes. This will make it easier to cut the Baklava later. Bake the Baklava in the preheated oven for about 30-35 minutes or until it turns golden brown. While the Baklava is baking, prepare the syrup. In a saucepan, combine the water, honey, and lemon juice. Bring the mixture to a boil, then reduce the heat and simmer for about 10 minutes. Remove the Baklava from the oven and immediately pour the hot syrup over the hot Baklava. Allow the Baklava to cool completely in the baking dish. Once cooled, carefully cut along the scored lines. Serve the Turkish Baklava at room temperature and enjoy this sweet and nutty dessert!",
    "rating": 4.9
  },
  {
    "recipeId": 26,
    "chefId": 6,
    "recipeName": "Turkish Pide",
    "foodImage": "https://www.foodiesfeed.com/wp-content/uploads/2023/03/traditional-turkish-baklava-dessert-detail.jpg",
    "ingredients": [
      "2 cups all-purpose flour",
      "1 tsp. instant yeast",
      "1 tsp. sugar",
      "1/2 tsp. salt",
      "3/4 cup warm water",
      "1 tbsp. olive oil",
      "1/2 lb. ground beef or lamb",
      "1 small onion, finely chopped",
      "1 small red bell pepper, finely chopped",
      "2 tomatoes, diced",
      "2 tbsp. tomato paste",
      "1 tsp. ground cumin",
      "1 tsp. paprika",
      "Salt and pepper, to taste",
      "Fresh parsley, chopped, for garnish"
    ],
    "cookingMethod": "In a mixing bowl, combine the all-purpose flour, instant yeast, sugar, and salt. Add the warm water and olive oil. Mix everything together until a dough forms. Knead the dough on a lightly floured surface for about 5 minutes until it becomes smooth and elastic. Place the dough in a greased bowl, cover it with a clean kitchen towel, and let it rise in a warm place for about 1 hour or until it doubles in size. Meanwhile, prepare the filling. In a skillet, cook the ground beef or lamb over medium heat until browned. Add the finely chopped onion, red bell pepper, diced tomatoes, tomato paste, ground cumin, paprika, salt, and pepper. Stir everything together and cook for about 5-7 minutes until the onions become translucent and the tomatoes release their juices. Preheat the oven to 475°F. Punch down the risen dough and divide it into smaller portions. Roll each portion into an oval or elongated shape. Place the rolled dough on a baking sheet lined with parchment paper. Spread a generous amount of the filling mixture over each dough, leaving a border around the edges. Fold the edges of the dough over the filling to create a boat-like shape. Bake the Turkish Pide in the preheated oven for about 12-15 minutes or until the crust is golden brown. Remove from the oven and garnish with fresh chopped parsley. Serve the Turkish Pide hot and enjoy this delicious and satisfying Turkish flatbread!",
    "rating": 4.7
  },
  {
    "recipeId": 27,
    "chefId": 6,
    "recipeName": "Turkish Kisir (Bulgur Salad)",
    "foodImage": "https://www.foodiesfeed.com/wp-content/uploads/2023/03/traditional-turkish-baklava-dessert-detail.jpg",
    "ingredients": [
      "1 cup fine bulgur",
      "1 cup boiling water",
      "2 tbsp. tomato paste",
      "2 tbsp. olive oil",
      "1 small onion, finely chopped",
      "1 small cucumber, finely chopped",
      "1 small red bell pepper, finely chopped",
      "1/2 cup fresh parsley, chopped",
      "1/4 cup fresh mint leaves, chopped",
      "Juice of 1 lemon",
      "1 tsp. ground cumin",
      "1 tsp. paprika",
      "Salt and pepper, to taste",
      "Lettuce leaves, for serving",
      "Lemon wedges, for serving"
    ],
    "cookingMethod": "Place the fine bulgur in a heatproof bowl. Pour the boiling water over the bulgur, cover the bowl with a lid or plate, and let it sit for about 10 minutes or until the bulgur absorbs the water and becomes soft. In a separate bowl, combine the tomato paste, olive oil, finely chopped onion, cucumber, red bell pepper, fresh parsley, fresh mint leaves, lemon juice, ground cumin, paprika, salt, and pepper. Mix everything together until well combined. Once the bulgur is ready, fluff it with a fork and add it to the bowl with the vegetable mixture. Mix everything together until all the ingredients are evenly distributed. Taste and adjust the seasoning if needed. Let the Kisir salad sit for about 30 minutes to allow the flavors to meld together. To serve, line a plate with lettuce leaves and spoon the Kisir salad on top. Garnish with additional fresh herbs if desired. Serve with lemon wedges on the side. Enjoy this refreshing and flavorful Turkish bulgur salad!",
    "rating": 4.6
  },

  {
    "recipeId": 28,
    "chefId": 5,
    "recipeName": "Turkish Manti",
    "foodImage": "https://www.foodiesfeed.com/wp-content/uploads/2023/03/traditional-turkish-baklava-dessert-detail.jpg",
    "ingredients": [
      "1 lb. ground lamb or beef",
      "1 small onion, finely chopped",
      "2 cloves garlic, minced",
      "1 tsp. ground cumin",
      "1 tsp. paprika",
      "1/2 tsp. ground cinnamon",
      "Salt and pepper, to taste",
      "1 package of square wonton wrappers",
      "1/2 cup plain yogurt",
      "2 tbsp. melted butter",
      "1 tsp. dried mint leaves",
      "1/4 cup tomato sauce",
      "2 tbsp. olive oil",
      "Fresh parsley, chopped, for garnish"
    ],
    "cookingMethod": "In a mixing bowl, combine the ground lamb or beef, finely chopped onion, minced garlic, ground cumin, paprika, ground cinnamon, salt, and pepper. Mix everything together until well combined. Place a small amount of the meat mixture onto each square wonton wrapper. Fold the wrapper in half to form a triangle, then pinch the edges together to seal. Bring a large pot of salted water to a boil. Carefully add the manti to the boiling water and cook for about 8-10 minutes or until they float to the surface. While the manti are cooking, prepare the sauce. In a small saucepan, heat the tomato sauce and olive oil together until warmed through. Remove the cooked manti from the water using a slotted spoon and transfer them to a serving dish. Drizzle the melted butter over the manti. Spoon the plain yogurt and tomato sauce mixture over the manti. Sprinkle dried mint leaves and chopped fresh parsley on top. Serve the Turkish Manti hot and enjoy this delightful and flavorful dish!",
    "rating": 4.8
  },
  {
    "recipeId": 29,
    "chefId": 5,
    "recipeName": "Turkish Karniyarik",
    "foodImage": "https://www.foodiesfeed.com/wp-content/uploads/2023/03/traditional-turkish-baklava-dessert-detail.jpg",
    "ingredients": [
      "2 large eggplants",
      "1/2 lb. ground beef",
      "1 small onion, finely chopped",
      "2 cloves garlic, minced",
      "2 tomatoes, diced",
      "2 tbsp. tomato paste",
      "1 tsp. ground cumin",
      "1 tsp. paprika",
      "Salt and pepper, to taste",
      "2 tbsp. olive oil",
      "Fresh parsley, chopped, for garnish"
    ],
    "cookingMethod": "Preheat the oven to 400°F. Cut the eggplants in half lengthwise and scoop out the flesh, leaving a shell. Sprinkle the inside of the eggplant shells with salt and let them sit for about 15 minutes to remove excess moisture. Rinse the eggplant shells and pat them dry with a paper towel. In a skillet, cook the ground beef over medium heat until browned. Add the finely chopped onion, minced garlic, diced tomatoes, tomato paste, ground cumin, paprika, salt, and pepper. Stir everything together and cook for about 5-7 minutes until the onions become translucent and the tomatoes release their juices. In a baking dish, drizzle olive oil and place the eggplant shells. Stuff the eggplant shells with the cooked ground beef mixture. Cover the baking dish with foil and bake in the preheated oven for about 40 minutes or until the eggplants are tender. Remove from the oven and garnish with chopped fresh parsley. Serve the Turkish Karniyarik hot and enjoy this delicious and satisfying dish!",
    "rating": 4.9
  }
]
